<?php

namespace App\Http\Controllers;

use Illuminate\Http\Request;
use Illuminate\Support\Arr;

class ConvertController extends Controller
{

    public const FIELDS = [
        0 => "Обращение",
        1 => "Имя",
        2 => "Отчество",
        3 => "Фамилия",
        4 => "Суффикс",
        5 => "Организация",
        6 => "Отдел",
        7 => "Должность",
        8 => "Улица (раб. адрес)",
        9 => "Улица 2 (раб. адрес)",
        10 => "Улица 3 (раб. адрес)",
        11 => "Город (раб. адрес)",
        12 => "Область (раб. адрес)",
        13 => "Индекс (раб. адрес)",
        14 => "Страна или регион (раб. адрес)",
        15 => "Улица (дом. адрес)",
        16 => "Улица 2 (дом. адрес)",
        17 => "Улица 3 (дом. адрес)",
        18 => "Город (дом. адрес)",
        19 => "Область (дом. адрес)",
        20 => "Почтовый код (дом.)",
        21 => "Страна или регион (дом. адрес)",
        22 => "Улица (другой адрес)",
        23 => "Улица  2 (другой адрес)",
        24 => "Улица  3 (другой адрес)",
        25 => "Город  (другой адрес)",
        26 => "Область  (другой адрес)",
        27 => "Индекс  (другой адрес)",
        28 => "Страна или регион  (другой адрес)",
        29 => "Телефон помощника",
        30 => "Рабочий факс",
        31 => "Рабочий телефон",
        32 => "Телефон раб. 2",
        33 => "Обратный вызов",
        34 => "Телефон в машине",
        35 => "Основной телефон организации",
        36 => "Домашний факс",
        37 => "Домашний телефон",
        38 => "Телефон дом. 2",
        39 => "ISDN",
        40 => "Телефон переносной",
        41 => "Другой факс",
        42 => "Другой телефон",
        43 => "Пейджер",
        44 => "Основной телефон",
        45 => "Радиотелефон",
        46 => "Телетайп/телефон с титрами",
        47 => "Телекс",
        48 => "Важность",
        49 => "Веб-страница",
        50 => "Годовщина",
        51 => "День рождения",
        52 => "Дети",
        53 => "Заметки",
        54 => "Имя помощника",
        55 => "Инициалы",
        56 => "Категории",
        57 => "Ключевые слова",
        58 => "Код организации",
        59 => "Личный номер",
        60 => "Отложено",
        61 => "Пол",
        62 => "Пользователь 1",
        63 => "Пользователь 2",
        64 => "Пользователь 3",
        65 => "Пользователь 4",
        66 => "Пометка",
        67 => "Почтовый ящик (дом. адрес)",
        68 => "Почтовый ящик (другой адрес)",
        69 => "Почтовый ящик (раб. адрес)",
        70 => "Профессия",
        71 => "Расположение",
        72 => "Расположение комнаты",
        73 => "Расстояние",
        74 => "Руководитель",
        75 => "Сведения о доступности в Интернете",
        76 => "Сервер каталогов",
        77 => "Супруг(а)",
        78 => "Счет",
        79 => "Счета",
        80 => "Хобби",
        81 => "Частное",
        82 => "Адрес эл. почты",
        83 => "Тип эл. почты",
        84 => "Краткое имя эл. почты",
        85 => "Адрес 2 эл. почты",
        86 => "Тип 2 эл. почты",
        87 => "Краткое 2 имя эл. почты",
        88 => "Адрес 3 эл. почты",
        89 => "Тип 3 эл. почты",
        90 => "Краткое 3 имя эл. почты",
        91 => "Язык"
    ];

    public function csvToVcfIndex(Request $request)
    {
        $frd = $request->all();

        return view('index');
    }

    public function csvToVcfConvert(Request $request)
    {
        $frd = $request->all();
        $file = Arr::get($frd, 'file');
        $handle = fopen($file, "r");
        $row = 0;
        if ($handle !== FALSE) {
            while (($data = fgetcsv($handle, 1000, ",")) !== FALSE) {
                $newCart = '';
                $num = count($data);


                if ($row > 0) {
                    for ($c = 0; $c < $num; $c++) {
                        switch ($c) {
                            case 1:

                                dd($data[$c]);
                                break;
                        }

                        echo $data[$c] . "<br />\n";
                    }
                }

                $row++;
            }
            fclose($handle);
        }
        dd($data);

        $fileContent = file_get_contents($file);
        $fileExplode = explode("\r\n", $fileContent);
        $head = Arr::first($fileExplode);
        $content = Arr::forget($fileExplode, 0);

        dd($head, $content);

    }

}
